1yib.rust-bundle
adamwojcikit.cli-for-microsoft-365-extension
bradlc.vscode-tailwindcss
clinyong.vscode-css-modules
dbaeumer.vscode-eslint
docker.docker
dotjoshjohnson.xml
ducfilan.pug-formatter
dustypomerleau.rust-syntax
ecmel.vscode-html-css
editorconfig.editorconfig
endormi.2077-theme
esbenp.prettier-vscode
felixschober.powerapps-portal-local-development
fill-labs.dependi
firefox-devtools.vscode-firefox-debug
github.copilot
github.copilot-chat
github.vscode-github-actions
glenn2223.live-sass
hoovercj.vscode-power-mode
jebbs.plantuml
josee9988.minifyall
kevinrose.vsc-python-indent
mathematic.vscode-pdf
mechatroner.rainbow-csv
microsoft-isvexptools.powerplatform-vscode
mrcrowl.easy-less
ms-azure-devops.azure-pipelines
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-bicep
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.dotnet-interactive-vscode
ms-dotnettools.dotnet-maui
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-ai-remote
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.azurecli
ms-vscode.powershell
ms-vscode.vscode-speech
ms-windows-ai-studio.microsoft-ai-tools-pack
ms-windows-ai-studio.windows-ai-studio
msjsdiag.vscode-react-native
prompt-flow.prompt-flow
redhat.java
ritwickdey.liveserver
rust-lang.rust-analyzer
shakram02.bash-beautify
shopify.theme-check-vscode
teamsdevapp.vscode-ai-foundry
timonwong.shellcheck
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
well-ar.plantuml
yzhang.markdown-all-in-one
